app/Http/Controllers/MainController.php

    public function welcome()
    {
        $news = News::with('category')
            ->where(['status' => 'draft'])
            ->orderBy('id', 'desc')
            ->paginate(8);
---
select * from `categories` where `categories`.`id` in (2, 3, 5, 6)
select * from `news` where (`status` = 'draft') order by `id` desc limit 8 offset 0
select count(*) as aggregate from `news` where (`status` = 'draft')