app/Http/Controllers/Admin/AdminNewsController.php

    public function index()
    {
        return view('admin.news.index', [
            'newsList' => News::with('category')->orderBy('id', 'desc')->paginate('8'),
        ]);
---
select * from `categories` where `categories`.`id` in (2, 3, 5, 6)
select * from `news` order by `id` desc limit 8 offset 0
select count(*) as aggregate from `news`

    public function create()
    {
        $categories = Category::all();
---
select * from `categories`

    public function edit(News $news)
    {
        $categories = Category::all();
---
select * from `categories`

    public function update(Request $request, News $news)
    {
        $request->validate([
            'title' => ['required']
        ]);

        $fields = $request->only('category_id', 'title', 'content', 'image', 'status');
        $news = $news->fill($fields)->save();
---
update `news` set `status` = 'published', `news`.`updated_at` = '2021-06-24 22:23:56' where `id` = 22