app/Http/Controllers/Admin/AdminCategoryController.php

select * from `categories`
---
    public function index()
    {
        $categories = Category::all();