app/Http/Controllers/News/NewsController.php

    public function showAllCategory()
    {
        return view('news.category', [
            'category' => Category::all(),
        ]);
---
select * from `categories`

    public function showCategoryNews(string $categoryName)
    {
        $category = Category::where('category_name', $categoryName)->first();
        $categoryNews = News::where('category_id', $category->id)->where('status', 'draft')->get();
---
select * from `categories` where `category_name` = 'Weather' limit 1
select * from `news` where `category_id` = 5 and `status` = 'draft'

    public function showNews(string $categoryName, $newsId)
    {
        $news = News::where(['id' => $newsId])->first();
---
select * from `news` where (`id` = '8') limit 1